Revit 2018 API
ViewDisplayBackground Methods
The ViewDisplayBackground type exposes the following members.
Methods
Name | Description
CreateGradient
 Creates an object that can be passed to DBView::setBackground function to set the background of the Gradient type.
CreateImage
 Creates an object that can be passed to DBView::setBackground function to set the background of the Image type.
CreateSky
 Creates an object that can be passed to DBView::setBackground function to set the background of the SunAndClouds type.
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
ViewDisplayBackground Class
Autodesk.Revit.DB Namespace